// 自动生成；坐标已换算为对应底图像素，数组后项覆盖前项。
const layer = (id, left, top, right, bottom) => ({id, bounds: [left, top, right, bottom]});

export default {
  name: "SeaOfBygoneEras",
  displayName: "旧日之海",
  size: [4096, 3072],
  origin: [6144, 3072],
  image: id => `./layers/UI_Map_LayeredMap_${id}.webp`,
  floors: {
    "-2": {
      label: "B2",
      areas: [
        {id: 1160003, floorId: 116000302, name: "安提库旧港·下层", layers: [
          layer(116000302, 1495.12, 1268.84, 1715.12, 1424.84),
        ]},
        {id: 1160004, floorId: 116000401, name: "雅努斯通道", layers: [
          layer(116000401, 1583.2002, 1479.59472, 2119.2002, 1759.59472),
        ]},
        {id: 1160007, floorId: 116000702, name: "黄金宫殿·下层", layers: [
          layer(116000702, 2526, 1435.16992, 2618, 1583.16992),
        ]},
      ],
    },
    "-1": {
      label: "B1",
      areas: [
        {id: 1160001, floorId: 116000101, name: "海柱之路", layers: [
          layer(116000101, 1152.8, 1582.0088, 1476.8, 1806.0088),
        ]},
        {id: 1160002, floorId: 116000201, name: "切萨勒姆宫", layers: [
          layer(116000201, 1333.2, 1586, 1537.2, 1934),
          layer(116000202, 1492.8404, 1638.41992, 1636.8404, 1842.41992),
        ]},
        {id: 1160003, floorId: 116000301, name: "安提库旧港·上层", layers: [
          layer(116000301, 1405.8404, 1231.1416, 1653.8404, 1479.1416),
        ]},
        {id: 1160004, floorId: 116000402, name: "卡皮托利姆", layers: [
          layer(116000402, 2030.4, 1251.92772, 2858.4, 2019.92772),
          layer(116000403, 2030.4, 1251.92772, 2858.4, 2019.92772),
          layer(116000404, 2030.4, 1251.92772, 2858.4, 2019.92772),
        ]},
        {id: 1160005, floorId: 116000501, name: "卡皮托利姆·谐律院", layers: [
          layer(116000501, 2104.00024, 1694.33008, 2308.00024, 1902.33008),
        ]},
        {id: 1160006, floorId: 116000601, name: "卡皮托利姆·旧宫", layers: [
          layer(116000601, 2446.0004, 1510.0176, 2718.0004, 1746.0176),
        ]},
        {id: 1160007, floorId: 116000701, name: "黄金宫殿·上层", layers: [
          layer(116000701, 2498.88, 1487.00684, 2658.88, 1647.00684),
        ]},
      ],
    },
    "0": {
      label: "地面",
      areas: [
        {id: 1160000, floorId: 116000001, name: "旧日之海", layers: [
          layer(116000001, 1365.2, 1221.8, 1921.2, 1753.8),
        ]},
      ],
    },
  },
};
